##第25关：各班人数最高分最低分平均分
##程序功能：某课程进行成绩分析，共N个班的成绩，输入N的值及各班的各位同学的成绩，输出班级人数、最高分、最低分、班级平均分（保留一位小数）。
##【输入描述】第一行输入1个整数N，然后再输入N行数据，每行是多个整数，分别对应各位同学的成绩，以空格隔开。
##【输出描述】分行输出各班的人数、最高分、最低分、班级平均分（保留一位小数），以空格隔开。
##【输入样例】3
##84 30 69 79 98 91 94 86 59 80 71
##83 80 62 73 95 92 84 86 59 90 70 76
##74 75 68 79 98 99 95 86 59 60
##【输出样例】11 98 30 76.5
##12 95 59 79.2
##10 99 59 79.3

n = int(input())

results = []
for i in range(n):
    score = list(map(int, input().split()))
    results.append([len(score), max(score), min(score),f"{sum(score)/len(score):.1f}"])

for x in results:
    print(" ".join(map(str,x)))
