##第26关：冠军编号
##程序功能：校园知识竞赛火热进行中，有10位同学进入最后的决赛。决赛第一轮是必答题，每位选手带着成绩进入下一轮。第二轮是抢答环节，只有答对的抢答者才能得分，每题为10分。两轮的得分之和即为选手的最终得分。请你编写程序，统计选手总分，并计算出最后的冠军选手。
##【输入描述】包括2行。 第一行是10个整数，表示10位选手的第一轮得分； 第二行是抢答题答对者的编号（编号从1开始）。
##【输出描述】包括2行。 第一行输出10位选手的最终得分； 第二行输出冠军选手的编号。 如有多位选手并列第一，则输出多个编号。 注意，输出多个数据时，中间用空格隔开，结尾没有空格。
##【输入样例】20 10 10 10 20 10 30 10 20 10
##1 5 4 1 7
##【输出样例】40 10 10 20 30 10 40 10 20 10
##1 7

scores = list(map(int, input().split()))

qd = list(map(int, input().split()))

for i in qd:
    scores[i-1] = scores[i-1] + 10

print(" ".join(map(str, scores)))

for i in range(len(scores)):
    if scores[i] == max(scores):
        print(i+1,end=" ")
