##第24关：税后工资
##程序功能：个人所得税规定如下：按年度收入征收，起征点额度为60000元；先计算得到年度收入扣除起征点额度后的余额，再按下表列出的累进税率计算应缴税额： 例如，某职工年度收入为100000元，扣除起征点额度后的余额为40000。他应缴的税为36000*0.03+（40000-36000）*0.1=1480元。编写一个程序，输入税前年度收入，输出扣税后的年收入。
##【输入描述】一个整数，表示年度收入。
##【输出描述】一个实数（保留整数），表示年度税后收入
##【输入样例】70000
##【输出样例】69700

m = int(input())

if m <= 60000:
    print("{:.0f}".format(m))
elif 0 < (m-60000) <= 36000:
    print("{:.0f}".format(m-(m-60000)*0.03))
elif 36000 < (m-60000) <= 144000:
    print("{:.0f}".format(m-36000*0.03-(m-96000)*0.1))
elif 144000 < (m-60000) <= 300000:
    print("{:.0f}".format(m-36000*0.03-108000*0.1-(m-204000)*0.2))
elif (m-60000) > 300000:
    print("{:.0f}".format(m-36000*0.03-108000*0.1-156000*0.2-(m-360000)*0.25))
