##第20关：工资计算
##程序功能：某公司员工的工资计算方法如下： 一周内工作时间不超过40小时，按正常工作时间计酬；
##超出40小时的工作时间部分，按正常工作时间报酬的1.5倍计酬。
##员工按进公司时间分为新职工和老职工： 5年以下的为新职工，正常工资为30元/小时；
##5年及以上的为老职工，正常工资为50元/小时。
##请按该计酬方式计算员工的工资。
##【输入描述】输入在一行中给出2个正整数，分别为某员工入职年数和周工作时间，其间以空格分隔。
##【输出描述】输出该员工的周薪，精确到小数点后2位。
##【输入样例】5 40
##【输出样例】2000.00

a,b=list(map(int,input().split()))
if a < 5:
    if b <= 40:
        print("{:.2f}".format(30*b))
    elif b > 40:
        print("{:.2f}".format(40*30+30*1.5*(b-40)))
elif a >= 5:
    if b <= 40:
        print("{:.2f}".format(50*b))
    elif b > 40:
        print("{:.2f}".format(40*50+50*1.5*(b-40)))
