##第37关：身份证号找年龄最大最小
##程序功能：第2代居民身份证号码共有18位，从左至右依次为：六位数字地址码，八位数字出生日期码，三位数字顺序码和一位数字校验码。现有一批学生的姓名和身份证号码，请找出年龄最大和最小的学生。
##【输入描述】第一行输入一个整数N；然后输入N行数据，每行包括：姓名，身份证号码，用空格分隔。
##【输出描述】分两行输出：第一行是年龄最大学生的姓名和身份证号码，第二行是年龄最小学生的姓名和身份证号码，姓名和身份证号码用空格分隔。
##【输入样例】4
##chen 330521197911212311
##wang 330103201409181231
##xiaowu 320401198501102823
##zhao 330102200503072171
##【输出样例】chen 330521197911212311
##wang 330103201409181231

n = int(input())
ls =[]
for i in range(n):
    n,c = input().split()
    ls.append([n,c, c[6:14]])
ls.sort(key=lambda x:x[2])
print(ls[0][0]+" "+ls[0][1])
print(ls[-1][0]+" "+ls[-1][1])
