##第36题：知识竞赛（冠军编号，每行一个）
##【程序功能】校园知识竞赛火热进行中，有10位同学进入最后的决赛。
##决赛第一轮是必答题，每位选手带着成绩进入下一轮。
##第二轮是抢答环节，只有答对的抢答者才能得分，每题为10分。
##两轮的得分之和即为选手的最终得分。请你编写程序，统计选手总分，并计算出最后的冠军选手。
##【输入描述】包括2行。第一行是10个整数，表示10位选手第一轮得分；第二行是抢答题答对者的编号(编号从1开始)。
##【输出描述】输出冠军选手的编号。如有多位选手并列第一，则输出多个编号（每行输出一个编号）。
##【输入样例】20 10 10 10 20 10 30 10 20 10
##1 5 4 1 7
##【输出样例】7

s=[int(i) for i in input().split()]
s1=[int(i) for i in input().split()]
d={}
for i in range(1,11):
    d[i]=s[i-1]
for i in s1:
    d[i]=d[i]+10
s2=[str(i) for i in d.values()]
print(" ".join(s2))
s3=[str(k) for k,v in d.items() if v==max(d.values())]
print("\n".join(s3))
