##第30关：员工考核结果
##程序功能：公司一年一度的年度晋升考核结束了，35岁（含）以上的员工考核分在80分（含）以上为合格，35岁以下的员工考核分在90分（含）以上为合格。现在有一个部门员工的年龄及考核成绩，根据要求审核员工是否能晋升，给出考核结果及部门总晋升人数。
##【输入描述】第一行输入一个整数N，然后再输入N行数据，每行2个整数，分别对应一个员工的年龄、考核成绩，中间用空格隔开。
##【输出描述】每行输出相应员工的考核结果，若能晋升，则输出晋升，否则输出原岗。并在最后一行给出总晋升人数。
##【输入样例】8
##30 92
##31 88
##32 90
##35 80
##35 81
##35 70
##38 85
##37 75
##【输出样例】晋升
##原岗
##晋升
##晋升
##晋升
##原岗
##晋升
##原岗
##5

n = int(input())
ls=[]
for i in range(n):
  y,c=map(int,input().split())
  if y>= 35 and c >= 80 or y<35 and c>=90:
    ls.append('晋升')
  else:
      ls.append('原岗')
for x in ls:
  print(x)
print(ls.count('晋升'))
