##第35关：回文数猜想
##程序功能：“回文数”是指从左向右读和从右向左读都一样的正整数，如101、32123、6666等。
##数学上有个“回文数猜想”：不论开始是什么正整数（两位以上），在经过有限次正序数和倒序数相加的步骤后，都会得到一个回文数。
##例如：69变成165（69+96），再变成726（165+561），再变成1353（726+627），最后变成4884（1353+3531），69经过4步演算得到回文数4884。
##请你编写程序，输入一个正整数，计算需要经过多少步就能得到回文数。为了简化，如果超出30步，则演算终止，并输出“>30”。
##【输入描述】输入一个两位以上的正整数。
##【输出描述】输出两个数，输出得到回文数的演算步数。若超出30步，则输出“>30”。
##【输入样例】69
##【输出样例】4

n = input()
count = 0
while n!=n[::-1]:
    n=str(int(n)+int(n [::-1]))
    count += 1
    if count>30:
        print('>30')
        break
else:
    print(count)
