##第39关：完美数个数
##程序功能：输入一个整数序列，以及基准，要求统计并输出该序列中基准以上的完美数个数。完美数是指一个数的所有真约数之和等于它自身。比如：6和28。6的真约数有1、2、3，且它们之和等于6；28的真约数有1、2、4、7、14，且它们之和等于28。
##【输入格式】第一行先给出序列长度n（n≤20），第2行包含n个整数；第3行包含一个整数，为基准。
##【输出格式】一个整数，表示输入的整数序列中基准以上的完美数个数。
##【输入样例】3
##6 17 28
##28
##【输出样例】1

n = int(input())
nums = list(map(int,input().split()))
jz = int(input())
count = 0
for x in nums:
    sumx = 0
    for i in range(1,x):
        if x % i == 0:
                sumx += i
    if sumx == x and x >= jz:
            count += 1
print(count)
